

/*- Користувач вводить або має два числа.
Потрібно знайти та вивести максимальне число з тих двох .
Також потрібно врахувати коли введені рівні числа.
*/
let a = +prompt('Введіть перше число');
let b = +prompt('Введіть друге число');
if (a>b) console.log(`${a} більше`);
else if (b>a) console.log(`${b} більше`);
else console.log('Однакові числа');

/*- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
*/
let number = +prompt('Введіть номер квартири');
if (number > 0 && number < 21) console.log("Квартира у першому під'їзді");
else if (number > 20 && number < 49) console.log("Квартира у другому під'їзді");
else if (number > 48 && number < 90) console.log("Квартира у третьому під'їзді");
else console.log('Такої квартири не існує');

/*- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
якщо змінна не рівна 10 - тоді НЕВІРНО*/
let tmp = +prompt('Введіть числове значення');
if (tmp === 10) console.log('ВІРНО');
else console.log('НЕВІРНО');

/*- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
якщо в змінну записали щось інше, спрацьовує else*/
let x = [1,2,3,4,5];
switch (typeof x){
    case 'number':
        console.log('1 - number');
        break;
    case 'string':
        console.log('2 - string');
        break;
    case 'boolean':
        console.log('3 - boolean');
        break;
    case 'object':
        console.log('4 - object');
        break;
    default:
        console.log('something else');
}


/*- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН*/
let temperature = +prompt('Введіть температуру');
if (temperature >= 10 && temperature <=22) console.log('йдемо ВЧИТИСЯ');
else console.log('сидимо вдома і вчимося ОНЛАЙН');

/* - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .*/
let game = +prompt('Введіть число від 1 до 5');
switch (game){
    case 1:
        console.log('Вітаємо, ви виграли автомобіль');
        break;
    case 2:
        console.log('Вітаємо, ви виграли мотоцикл');
        break;
    case 3:
        console.log('Вітаємо, ви виграли телефон');
        break;
    case 4:
        console.log('Вітаємо, ви виграли квартиру');
        break;
    case 5:
        console.log('Вітаємо, ви виграли шоколадну медаль');
        break;
    default:
        console.log('Невірно введено число');
}

